dist/envelopes.js

"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.envelopeZaloguj = function (key) { return "\n<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:ns=\"http://CIS/BIR/PUBL/2014/07\">\n    <soap:Header xmlns:wsa=\"http://www.w3.org/2005/08/addressing\">\n        <wsa:To>https://wyszukiwarkaregon.stat.gov.pl/wsBIR/UslugaBIRzewnPubl.svc</wsa:To>\n        <wsa:Action>http://CIS/BIR/PUBL/2014/07/IUslugaBIRzewnPubl/Zaloguj</wsa:Action>\n    </soap:Header>\n    <soap:Body>\n        <ns:Zaloguj>\n            <ns:pKluczUzytkownika>" + key + "</ns:pKluczUzytkownika>\n        </ns:Zaloguj>\n    </soap:Body>\n</soap:Envelope>\n"; };
exports.envelopeWyloguj = function (sid) { return "\n<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:ns=\"http://CIS/BIR/PUBL/2014/07\">\n    <soap:Header xmlns:wsa=\"http://www.w3.org/2005/08/addressing\">\n        <wsa:To>https://wyszukiwarkaregon.stat.gov.pl/wsBIR/UslugaBIRzewnPubl.svc</wsa:To>\n        <wsa:Action>http://CIS/BIR/PUBL/2014/07/IUslugaBIRzewnPubl/Wyloguj</wsa:Action>\n    </soap:Header>\n    <soap:Body>\n        <ns:Wyloguj>\n            <ns:pIdentyfikatorSesji>" + sid + "</ns:pIdentyfikatorSesji>\n        </ns:Wyloguj>\n    </soap:Body>\n</soap:Envelope>\n"; };
exports.envelopeDaneSzukajPodmioty = function (params) { return "\n<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:ns=\"http://CIS/BIR/PUBL/2014/07\" xmlns:dat=\"http://CIS/BIR/PUBL/2014/07/DataContract\">\n    <soap:Header xmlns:wsa=\"http://www.w3.org/2005/08/addressing\">\n        <wsa:To>https://wyszukiwarkaregon.stat.gov.pl/wsBIR/UslugaBIRzewnPubl.svc</wsa:To>\n        <wsa:Action>http://CIS/BIR/PUBL/2014/07/IUslugaBIRzewnPubl/DaneSzukajPodmioty</wsa:Action>\n    </soap:Header>\n    <soap:Body>\n        <ns:DaneSzukajPodmioty>\n            <ns:pParametryWyszukiwania>\n                " + (params.Regon ? "<dat:Regon>" + params.Regon + "</dat:Regon>" : '') + "\n                " + (params.Nip ? "<dat:Nip>" + params.Nip + "</dat:Nip>" : '') + "\n                " + (params.Krs ? "<dat:Krs>" + params.Krs + "</dat:Krs>" : '') + "\n                " + (params.Nipy ? "<dat:Nipy>" + params.Nipy.join(',') + "</dat:Nipy>" : '') + "\n                " + (params.Regony9zn ? "<dat:Regony9zn>" + params.Regony9zn.join(',') + "</dat:Regony9zn>" : '') + "\n                " + (params.Krsy ? "<dat:Krsy>" + params.Krsy + "</dat:Krsy>" : '') + "\n                " + (params.Regony14zn ? "<dat:Regony14zn>" + params.Regony14zn + "</dat:Regony14zn>" : '') + "\n            </ns:pParametryWyszukiwania>\n        </ns:DaneSzukajPodmioty>\n    </soap:Body>\n</soap:Envelope>\n"; };
